In [1]:
import pandas as pd

In [3]:
df_channel = pd.read_csv('orders_channels.csv')
df_country = pd.read_csv('orders_country.csv')
df_tickets = pd.read_csv('orders_tickets.csv')

In [4]:
df_channel.head()

       id        date  channel_id
0   10173  2017-06-12        39.0
1   95062  2017-09-11        35.0
2  171081  2017-07-05        39.0
3  122867  2017-08-18        39.0
4  107186  2017-11-23         NaN

In [5]:
df_channel.shape

(2054059, 3)

In [6]:
df_country.head()

      id  country_1 country_2
0  10503       24.0       NaN
1  79360       24.0         0
2  81388       24.0        15
3  82828       24.0         9
4  38756       23.0       NaN

In [7]:
df_tickets.head()

        id  n_tickets type
0  1586391          2  pax
1   438232          2  pax
2   270896          1  pax
3  1181593          2  pax
4   964842          1  pax

In [8]:
df_tickets.shape

(1999716, 3)